starter-kit-ruby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Ruby</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Ruby</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Ruby</h2>
<div class="outline-text-2" id="text-1">
<p>
Support for the <a href="http://www.ruby-lang.org/en/">Ruby</a> dynamic, open-source programming language.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'ruby-mode
  '(<span style="font-weight: bold;">progn</span>
     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">work around possible elpa bug</span>
     (<span style="font-weight: bold;">ignore-errors</span> (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ruby-compilation</span>))
     (setq ruby-use-encoding-map nil)
     (define-key ruby-mode-map (kbd <span style="font-style: italic;">"RET"</span>) 'reindent-then-newline-and-indent)
     (define-key ruby-mode-map (kbd <span style="font-style: italic;">"C-M-h"</span>) 'backward-kill-word)
     (define-key ruby-mode-map (kbd <span style="font-style: italic;">"C-c l"</span>) <span style="font-style: italic;">"lambda"</span>)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-h r"</span>) 'ri)
</pre>
</div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Yaml mode</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'yaml-mode)
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">yaml-mode</span>)
(add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.ya?ml$"</span> . yaml-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-additional-file-extensions" class="outline-3">
<h3 id="additional-file-extensions"><a id="sec-1-2" name="sec-1-2"></a>Rake files are ruby, too, as are gemspecs.</h3>
<div class="outline-text-3" id="text-additional-file-extensions">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.rake$"</span> . ruby-mode))
(add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"Rakefile$"</span> . ruby-mode))
(add-to-list 'auto-mode-alist '(<span style="font-style: italic;">"\\.gemspec$"</span> . ruby-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-ignore-rubinius" class="outline-3">
<h3 id="ignore-rubinius"><a id="sec-1-3" name="sec-1-3"></a>We never want to edit Rubinius bytecode</h3>
<div class="outline-text-3" id="text-ignore-rubinius">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'completion-ignored-extensions <span style="font-style: italic;">".rbc"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-rake" class="outline-3">
<h3 id="rake"><a id="sec-1-4" name="sec-1-4"></a>Rake</h3>
<div class="outline-text-3" id="text-rake">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">pcomplete/rake</span> ()
  <span style="font-style: italic;">"Completion rules for the `</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">ssh</span><span style="font-style: italic;">' command."</span>
  (pcomplete-here (pcmpl-rake-tasks)))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">pcmpl-rake-tasks</span> ()
  <span style="font-style: italic;">"Return a list of all the rake tasks defined in the current</span>
<span style="font-style: italic;">projects.  I know this is a hack to put all the logic in the</span>
<span style="font-style: italic;">exec-to-string command, but it works and seems fast"</span>
  (delq nil (mapcar (<span style="font-weight: bold;">lambda</span> (line)
                      (<span style="font-weight: bold;">if</span> (string-match <span style="font-style: italic;">"rake </span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[</span><span style="font-style: italic;">^</span><span style="font-style: italic;"> ]+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">"</span> line) (match-string 1 line)))
                    (split-string (shell-command-to-string <span style="font-style: italic;">"rake -T"</span>) <span style="font-style: italic;">"[\n]"</span>))))

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">rake</span> (task)
  (interactive (list (completing-read <span style="font-style: italic;">"Rake (default: default): "</span>
                                      (pcmpl-rake-tasks))))
  (shell-command-to-string (concat <span style="font-style: italic;">"rake "</span> (<span style="font-weight: bold;">if</span> (= 0 (length task)) <span style="font-style: italic;">"default"</span> task))))
</pre>
</div>
</div>
</div>

<div id="outline-container-compilation" class="outline-3">
<h3 id="compilation"><a id="sec-1-5" name="sec-1-5"></a>Compilation</h3>
<div class="outline-text-3" id="text-compilation">
<p>
Clear the compilation buffer between test runs.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'ruby-compilation
  '(<span style="font-weight: bold;">progn</span>
     (<span style="font-weight: bold;">defadvice</span> <span style="font-weight: bold;">ruby-do-run-w/compilation</span> (before kill-buffer (name cmdlist))
       (<span style="font-weight: bold;">let</span> ((comp-buffer-name (format <span style="font-style: italic;">"*%s*"</span> name)))
         (<span style="font-weight: bold;">when</span> (get-buffer comp-buffer-name)
           (<span style="font-weight: bold;">with-current-buffer</span> comp-buffer-name
             (delete-region (point-min) (point-max))))))
     (ad-activate 'ruby-do-run-w/compilation)))
</pre>
</div>
</div>
</div>

<div id="outline-container-hooks" class="outline-3">
<h3 id="hooks"><a id="sec-1-6" name="sec-1-6"></a>Hooks</h3>
<div class="outline-text-3" id="text-hooks">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'ruby-mode-hook 'run-starter-kit-coding-hook)
</pre>
</div>

<p>
#+begin_src emacs-lisp
;; (add-hook 'ruby-mode-hook 'idle-highlight)
#+end_src emacs-lisp
</p>
</div>
</div>

<div id="outline-container-flymake" class="outline-3">
<h3 id="flymake"><a id="sec-1-7" name="sec-1-7"></a>Flymake</h3>
<div class="outline-text-3" id="text-flymake">

<div class="org-src-container">

<pre class="src src-emacs-lisp">(eval-after-load 'ruby-mode
  '(<span style="font-weight: bold;">progn</span>
     (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">flymake</span>)

     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Invoke ruby with '-c' to get syntax checking</span>
     (<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">flymake-ruby-init</span> ()
       (<span style="font-weight: bold;">let*</span> ((temp-file (flymake-init-create-temp-buffer-copy
                          'flymake-create-temp-inplace))
              (local-file (file-relative-name
                           temp-file
                           (file-name-directory buffer-file-name))))
         (list <span style="font-style: italic;">"ruby"</span> (list <span style="font-style: italic;">"-c"</span> local-file))))

     (push '(<span style="font-style: italic;">".+\\.rb$"</span> flymake-ruby-init) flymake-allowed-file-name-masks)
     (push '(<span style="font-style: italic;">"Rakefile$"</span> flymake-ruby-init) flymake-allowed-file-name-masks)

     (push '(<span style="font-style: italic;">"^</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">:</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">[0-9]+</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">: </span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">$"</span> 1 2 nil 3)
           flymake-err-line-patterns)

     (add-hook 'ruby-mode-hook
               (<span style="font-weight: bold;">lambda</span> ()
                 (<span style="font-weight: bold;">when</span> (and buffer-file-name
                            (file-writable-p
                             (file-name-directory buffer-file-name))
                            (file-writable-p buffer-file-name))
                   (local-set-key (kbd <span style="font-style: italic;">"C-c d"</span>)
                                  'flymake-display-err-menu-for-current-line)
                   (flymake-mode t))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-rinari" class="outline-3">
<h3 id="rinari"><a id="sec-1-8" name="sec-1-8"></a>Rinari (Minor Mode for Ruby On Rails)</h3>
<div class="outline-text-3" id="text-rinari">
<p>
See <a href="http://rinari.rubyforge.org/">rinari.rubyforge</a> for more information on rinari.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq rinari-major-modes
      '(dired-mode 'ruby-mode  'css-mode 'yaml-mode 'javascript-mode))
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
